import 'package:flutter_simple_recipe_app/modal/recipe.dart';

List<Recipe> recipes = [
  Recipe(
    title: 'Спагетті з томатним соусом',
    imageUrl:
    'https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Spaghetti_Bolognese_mit_Parmesan_oder_Grana_Padano.jpg/800px-Spaghetti_Bolognese_mit_Parmesan_oder_Grana_Padano.jpg',
    duration: 20,
    ingredients:
          ' - 4 помідори\n'
          ' - 1 столова ложка оливкової олії\n'
          ' - 1 цибулина\n'
          ' - 250 г спагетті\n'
          ' - спеції\n'
          ' - сир',
    steps:
              ' - Помідори та цибулю наріжте невеликими шматочками.\n'
              ' - Закип\'ятіть воду - додайте сіль, коли вона закипить.\n'
              ' - Покладіть спагетті в киплячу воду - вони повинні бути готові приблизно за 10-12 хвилин.\n'
              ' - Тим часом розігрійте трохи оливкової олії та додайте нарізану цибулю.\n'
              ' - Через 2 хвилини додайте шматочки помідорів, сіль, перець та інші спеції.\n'
              " - Соус буде готовий, коли спагетті будуть.\n"
              ' - Не соромтеся додавати трохи сиру поверх готової страви.\n',
  ),
  Recipe(
    title: 'Тост Гаваї',
    imageUrl:
    'https://cdn.pixabay.com/photo/2018/07/11/21/51/toast-3532016_1280.jpg',
    duration: 10,
    ingredients:
        " - 1 скибочка білого хліба\n"
        " - 1 скибочка шинки\n"
        " - 1 скибочка ананаса\n"
        ' - 1-2 скибочки сиру\n'
        ' - Масло',
    steps:
    '- Масло з одного боку білого хліба\n'
    '- Викласти шинку, ананас і сир на білий хліб\n'
    '- Випікайте тост близько 10 хвилин у духовці при 200°C',

  ),
  Recipe(
    title: 'Класичний гамбургер',
    imageUrl:
    'https://cdn.pixabay.com/photo/2014/10/23/18/05/burger-500054_1280.jpg',
    duration: 45,
    ingredients:
    ' - 300 г м\'яса\n'
        " - 1 помідор\n"
        ' - 1 огірок\n'
        ' - 1 цибулина\n'
        ' - кетчуп\n'
    ' - 2 булочки для бургерів',
    steps:
    "Форма 2 пиріжки\n"
        ' - Смажте котлети для c. 4 хвилини з кожного боку\n'
        ' - Швидко обсмажте булочки для c. 1 хвилина з кожного боку\n'
        " - Намазати булочки кетчупом\n"
    ' - Подавати бургер з помідорами, огірками та цибулею',
  ),
  Recipe(
    title: 'Віденський шніцель',
    imageUrl:
    'https://cdn.pixabay.com/photo/2018/03/31/19/29/schnitzel-3279045_1280.jpg',
    duration: 60,
    ingredients:
        ' - 8 котлет з телятини\n'
        ' - 4 яйця\n'
        ' - 200 г панірувальних сухарів\n'
        ' - 100 г борошна\n'
        " - 300 мл вершкового масла\n"
        " - 100 г рослинної олії\n"
        ' - Сіль\n'
        ' - Скибочки лимона',
    steps:
'Пом’якшити телятину приблизно до 2–4 мм і посолити з обох боків.\n'
'На плоскій тарілці коротко розмішайте яйця виделкою.\n'
'Злегка обваляйте котлети в борошні, потім вмочіть у яйце і, нарешті, в панірувальні сухарі.\n'
'Нагрійте масло й олію у великій сковороді (нехай жир сильно нагріється) і обсмажте шніцелі до золотистої скоринки з обох сторін.\n'
'Обов\'язково кидайте сковороду регулярно, щоб шніцелі були оточені олією, а крихта стала «пухнастою».\n'
'Вийміть і обсушіть на кухонному папері. Обсмажте петрушку в олії, що залишилася, і процідіть.\n'
'Покладіть шніцелі на підігріту тарілку і подавайте, прикрасивши петрушкою і скибочками лимона.',
  ),
  Recipe(
    title: 'Салат з копченим лососем',
    imageUrl:
    'https://cdn.pixabay.com/photo/2016/10/25/13/29/smoked-salmon-salad-1768890_1280.jpg',
    duration: 15,
    ingredients:
        ' - рукола\n'
        " - Латук ягняти\n"
        " - Петрушка\n"
        " - Фенхель\n"
        ' - 200 г копченого лосося\n'
        ' - гірчиця\n'
        ' - Бальзамічний оцет\n'
        ' - Оливкова олія\n'
        ' - Сіль і перець\n',
    steps:
    'Помийте та наріжте салат і зелень\n'
    'Нарізати лосося кубиками\n'
  'Переробити гірчицю, оцет та оливкову олію в напій\n'
  'Приготувати салат\n'
  'Додати кубики лосося та заправку\n',
  ),
];


